---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.HandRailPosition.Right
enum: Autodesk.Revit.DB.Architecture.HandRailPosition
source: html/e148ecf7-7d63-4209-24f4-1add948318f9.htm
---
# Autodesk.Revit.DB.Architecture.HandRailPosition.Right

The hand rail is on the right side of railing.